; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	image0 - mode
	image1 - mode
	GroundStation0 - direction
	GroundStation2 - direction
	Star4 - direction
	GroundStation6 - direction
	GroundStation9 - direction
	GroundStation7 - direction
	Star5 - direction
	Star10 - direction
	GroundStation1 - direction
	GroundStation8 - direction
	Star3 - direction
	Star11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Star14 - direction
	Planet15 - direction
	Phenomenon16 - direction
	Star17 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 image1)
	(calibration_target instrument0 Star5)
	(calibration_target instrument0 GroundStation8)
	(supports instrument1 image1)
	(supports instrument1 image0)
	(calibration_target instrument1 Star3)
	(calibration_target instrument1 GroundStation1)
	(calibration_target instrument1 GroundStation8)
	(supports instrument2 image1)
	(calibration_target instrument2 Star5)
	(calibration_target instrument2 GroundStation1)
	(calibration_target instrument2 GroundStation7)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star10)
	(supports instrument3 image0)
	(supports instrument3 image1)
	(calibration_target instrument3 Star3)
	(calibration_target instrument3 Star5)
	(supports instrument4 image1)
	(supports instrument4 image0)
	(calibration_target instrument4 Star3)
	(calibration_target instrument4 GroundStation8)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star5)
	(supports instrument5 image1)
	(calibration_target instrument5 Star10)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star3)
	(supports instrument6 image0)
	(supports instrument6 image1)
	(calibration_target instrument6 Star10)
	(supports instrument7 image1)
	(supports instrument7 image0)
	(calibration_target instrument7 GroundStation8)
	(calibration_target instrument7 GroundStation1)
	(supports instrument8 image0)
	(supports instrument8 image1)
	(calibration_target instrument8 Star3)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation7)
)
(:goal (and
	(pointing satellite0 Star4)
	(pointing satellite1 GroundStation2)
	(have_image Star11 image1)
	(have_image Phenomenon12 image0)
	(have_image Phenomenon13 image1)
	(have_image Star14 image0)
	(have_image Planet15 image1)
	(have_image Phenomenon16 image1)
	(have_image Star17 image0)
))

)

; plan
1. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 9
2. (calibrate satellite1 instrument3 star5)
   added: (calibrated instrument3)
   goals met: 0 of 9
3. (turn_to satellite1 planet15 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 planet15)
   goals met: 0 of 9
4. (take_image satellite1 planet15 instrument3 image1)
   added: (have_image planet15 image1)
   goals met: 1 of 9
5. (turn_to satellite1 phenomenon16 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 phenomenon16)
   goals met: 1 of 9
6. (take_image satellite1 phenomenon16 instrument3 image1)
   added: (have_image phenomenon16 image1)
   goals met: 2 of 9
7. (turn_to satellite1 phenomenon13 phenomenon16)
   deleted: (pointing satellite1 phenomenon16)
   added: (pointing satellite1 phenomenon13)
   goals met: 2 of 9
8. (take_image satellite1 phenomenon13 instrument3 image1)
   added: (have_image phenomenon13 image1)
   goals met: 3 of 9
9. (turn_to satellite1 phenomenon12 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 phenomenon12)
   goals met: 3 of 9
10. (take_image satellite1 phenomenon12 instrument3 image0)
   added: (have_image phenomenon12 image0)
   goals met: 4 of 9
11. (turn_to satellite0 star4 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star4)
   goals met: 5 of 9
12. (turn_to satellite1 star11 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 star11)
   goals met: 5 of 9
13. (take_image satellite1 star11 instrument3 image1)
   added: (have_image star11 image1)
   goals met: 6 of 9
14. (turn_to satellite1 star14 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 star14)
   goals met: 6 of 9
15. (take_image satellite1 star14 instrument3 image0)
   added: (have_image star14 image0)
   goals met: 7 of 9
16. (turn_to satellite1 star17 star14)
   deleted: (pointing satellite1 star14)
   added: (pointing satellite1 star17)
   goals met: 7 of 9
17. (take_image satellite1 star17 instrument3 image0)
   added: (have_image star17 image0)
   goals met: 8 of 9
18. (turn_to satellite1 groundstation2 star17)
   deleted: (pointing satellite1 star17)
   added: (pointing satellite1 groundstation2)
   goals met: 9 of 9
